Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70N19.xml
        <register caption="FIFO Memory Aperture0 254" name="HSMCI_FIFO254" offset="0x5F8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 255" name="HSMCI_FIFO255" offset="0x5FC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
      </register-group>
      <value-group caption="" name="HSMCI_DTOR__DTOMUL">
        <value caption="DTOCYC" name="_1" value="0x0"/>
        <value caption="DTOCYC x 16" name="_16" value="0x1"/>
        <value caption="DTOCYC x 128" name="_128" value="0x2"/>
        <value caption="DTOCYC x 256" name="_256" value="0x3"/>
        <value caption="DTOCYC x 1024" name="_1024" value="0x4"/>
        <value caption="DTOCYC x 4096" name="_4096" value="0x5"/>
        <value caption="DTOCYC x 65536" name="_65536" value="0x6"/>
        <value caption="DTOCYC x 1048576" name="_1048576" value="0x7"/>
      </value-group>
      <value-group caption="" name="HSMCI_SDCR__SDCSEL">
        <value caption="Slot A is selected." name="SLOTA" value="0"/>
      </value-group>
      <value-group caption="" name="HSMCI_SDCR__SDCBUS">
        <value caption="1 bit" name="_1" value="0x0"/>
        <value caption="4 bits" name="_4" value="0x2"/>
        <value caption="8 bits" name="_8" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__RSPTYP">
        <value caption="No response" name="NORESP" value="0x0"/>
        <value caption="48-bit response" name="_48_BIT" value="0x1"/>
        <value caption="136-bit response" name="_136_BIT" value="0x2"/>
        <value caption="R1b response type" name="R1B" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__SPCMD">
        <value caption="Not a special CMD." name="STD" value="0x0"/>
        <value caption="Initialization CMD: 74 clock cycles for initialization sequence." name="INIT" value="0x1"/>
        <value caption="Synchronized CMD: Wait for the end of the current data block transfer before sending the pending command." name="SYNC" value="0x2"/>
        <value caption="CE-ATA Completion Signal disable Command. The host cancels the ability for the device to return a command completion signal on the command line." name="CE_ATA" value="0x3"/>
        <value caption="Interrupt command: Corresponds to the Interrupt Mode (CMD40)." name="IT_CMD" value="0x4"/>
        <value caption="Interrupt response: Corresponds to the Interrupt Mode (CMD40)." name="IT_RESP" value="0x5"/>
        <value caption="Boot Operation Request. Start a boot operation mode, the host processor can read boot data from the MMC device directly." name="BOR" value="0x6"/>
        <value caption="End Boot Operation. This command allows the host processor to terminate the boot operation mode." name="EBO" value="0x7"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__OPDCMD">
        <value caption="Push pull command." name="PUSHPULL" value="0"/>
        <value caption="Open drain command." name="OPENDRAIN" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__MAXLAT">
        <value caption="5-cycle max latency." name="_5" value="0"/>
        <value caption="64-cycle max latency." name="_64" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__TRCMD">
        <value caption="No data transfer" name="NO_DATA" value="0x0"/>
        <value caption="Start data transfer" name="START_DATA" value="0x1"/>
        <value caption="Stop data transfer" name="STOP_DATA" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__TRDIR">
        <value caption="Write." name="WRITE" value="0"/>
        <value caption="Read." name="READ" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__TRTYP">
        <value caption="MMC/SD Card Single Block" name="SINGLE" value="0x0"/>
        <value caption="MMC/SD Card Multiple Block" name="MULTIPLE" value="0x1"/>
        <value caption="MMC Stream" name="STREAM" value="0x2"/>
        <value caption="SDIO Byte" name="BYTE" value="0x4"/>
        <value caption="SDIO Block" name="BLOCK" value="0x5"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__IOSPCMD">
        <value caption="Not an SDIO Special Command" name="STD" value="0x0"/>
        <value caption="SDIO Suspend Command" name="SUSPEND" value="0x1"/>
        <value caption="SDIO Resume Command" name="RESUME" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__ATACS">
        <value caption="Normal operation mode." name="NORMAL" value="0"/>
        <value caption="This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR)." name="COMPLETION" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CSTOR__CSTOMUL">
        <value caption="CSTOCYC x 1" name="_1" value="0x0"/>
        <value caption="CSTOCYC x 16" name="_16" value="0x1"/>
        <value caption="CSTOCYC x 128" name="_128" value="0x2"/>
        <value caption="CSTOCYC x 256" name="_256" value="0x3"/>
        <value caption="CSTOCYC x 1024" name="_1024" value="0x4"/>
        <value caption="CSTOCYC x 4096" name="_4096" value="0x5"/>
        <value caption="CSTOCYC x 65536" name="_65536" value="0x6"/>
        <value caption="CSTOCYC x 1048576" name="_1048576" value="0x7"/>
      </value-group>
      <value-group caption="" name="HSMCI_DMA__CHKSIZE">
        <value caption="1 data available" name="_1" value="0x0"/>
        <value caption="2 data available" name="_2" value="0x1"/>
        <value caption="4 data available" name="_4" value="0x2"/>
        <value caption="8 data available" name="_8" value="0x3"/>
        <value caption="16 data available" name="_16" value="0x4"/>
      </value-group>
      <value-group caption="" name="HSMCI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x4D4349"/>
      </value-group>
    </module>
    <module caption="Integrity Check Monitor" name="ICM" version="11105D">
      <register-group name="ICM">
        <register caption="Configuration Register" name="ICM_CFG" offset="0x00" rw="RW" size="4">
          <bitfield caption="Write Back Disable" mask="0x00000001" name="WBDIS"/>
          <bitfield caption="End of Monitoring Disable" mask="0x00000002" name="EOMDIS"/>
          <bitfield caption="Secondary List Branching Disable" mask="0x00000004" name="SLBDIS"/>
          <bitfield caption="Bus Burden Control" mask="0x000000F0" name="BBC"/>
          <bitfield caption="Automatic Switch To Compare Digest" mask="0x00000100" name="ASCD"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000200" name="DUALBUFF"/>
          <bitfield caption="User Initial Hash Value" mask="0x00001000" name="UIHASH"/>
          <bitfield caption="User SHA Algorithm" mask="0x0000E000" name="UALGO" values="ICM_CFG__UALGO"/>
          <bitfield caption="Region Hash Area Protection" mask="0x003F0000" name="HAPROT"/>
          <bitfield caption="Region Descriptor Area Protection" mask="0x3F000000" name="DAPROT"/>
        </register>
        <register caption="Control Register" name="ICM_CTRL" offset="0x04" rw="W" size="4">
          <bitfield caption="ICM Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="ICM Disable Register" mask="0x00000002" name="DISABLE"/>
          <bitfield caption="Software Reset" mask="0x00000004" name="SWRST"/>
          <bitfield caption="Recompute Internal Hash" mask="0x000000F0" name="REHASH"/>
          <bitfield caption="Region Monitoring Disable" mask="0x00000F00" name="RMDIS"/>
          <bitfield caption="Region Monitoring Enable" mask="0x0000F000" name="RMEN"/>
        </register>
